{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report declaring no collected features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind base/theme variables defining light and dark OKLCH color palettes and global styles.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes with auth gating and provides the app’s router provider.",
  "frontend/src/components/auth/AuthCard.tsx": "Reusable styled authentication card with error display, submit handling, and footer navigation.",
  "frontend/src/components/auth/AuthGate.tsx": "Route guard that redirects based on Internet Identity auth state and shows a loading screen during init.",
  "frontend/src/components/auth/AuthPageLayout.tsx": "Page layout wrapper for login/register pages with branding, gradient background, and footer.",
  "frontend/src/components/auth/StorageNamespaceProvider.tsx": "Sets per-principal localStorage namespace based on authenticated Internet Identity state.",
  "frontend/src/components/layout/AppHeader.tsx": "Header with logout button that clears auth and redirects to login.",
  "frontend/src/components/projects/ProjectCard.tsx": "Project card UI supporting cover image upload, navigation to project screenplay, and display of project info.",
  "frontend/src/components/screenplay/BeatCard.tsx": "Beat display card showing metadata, guidance, and a textarea for editing beat content.",
  "frontend/src/components/screenplay/ScreenplayTabs.tsx": "Tabbed navigation for screenplay structures, references, and characters, rendering the appropriate tab content.",
  "frontend/src/components/screenplay/tabs/CharactersTab.tsx": "Manages project characters with add, delete, select, and edit functionality using local storage.",
  "frontend/src/components/screenplay/tabs/DanHarmonTab.tsx": "Loads and edits Dan Harmon story circle beat content for a project.",
  "frontend/src/components/screenplay/tabs/FichteanCurveTab.tsx": "Displays and updates Fichtean Curve beat entries sourced from project data.",
  "frontend/src/components/screenplay/tabs/HerosJourneyTab.tsx": "Renders Hero's Journey beats and saves per‑beat content changes.",
  "frontend/src/components/screenplay/tabs/ReferencesTab.tsx": "Provides a large textarea for editing and storing project reference notes.",
  "frontend/src/components/screenplay/tabs/SaveTheCatTab.tsx": "Shows Save the Cat beats and persists user‑entered text for each beat.",
  "frontend/src/components/screenplay/tabs/ThreeActTab.tsx": "Displays the three‑act structure with nested beats and saves beat content updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables and utilities for theme, layout, and accessibility.",
  "frontend/src/lib/beatDefinitions.ts": "Defines interfaces for beats and act sections and provides the Save the Cat beat list with detailed metadata.",
  "frontend/src/lib/pdfExport.ts": "Generates a text-based PDF export of screenplay data using multiple story structures and triggers a file download.",
  "frontend/src/lib/storage.ts": "Manages namespaced localStorage for projects, profiles, themes, and screenplay data, including creation and updates.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity provider and renders the main App component.",
  "frontend/src/pages/IndexPage.tsx": "Displays the project index with theme and profile controls, allowing project creation and navigation.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login via Internet Identity and redirects on success using an authentication UI layout.",
  "frontend/src/pages/ProfilePage.tsx": "Provides a profile editor for user details and profile image with save and navigation controls.",
  "frontend/src/pages/RegisterPage.tsx": "Handles account creation with Internet Identity using shared authentication components.",
  "frontend/src/pages/ScreenplayPage.tsx": "React page that loads a project and its data, displays a themed screenplay workspace with tabs, and provides navigation and PDF export.",
  "frontend/src/types.ts": "Defines TypeScript interfaces for projects, profiles, screenplay structures, characters, and project data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "JSON state document describing app goals, architecture notes, existing features, and metadata for the BRICK BY BRICK project."
}